In [67]:
import pandas as pd
import re

In [68]:
data_express = pd.read_excel('./Datas/Express.xlsx')
data_standart = pd.read_excel('./Datas/Standart.xlsx')
data_shipments = pd.read_csv('./Datas/Shipments2.csv')

In [69]:
#pd.set_option('display.max_columns', )
#pd.set_option('display.max_rows', None)

### Normalizando Dataframe data_shipments

In [70]:
data_shipments.head(1)

  to_postcode  to_country_id
0    00000000             32

In [78]:
data_shipments = data_shipments.rename(columns = {'to_postcode' : 'CEP'})

In [77]:
data_shipments.head()

         CEP  to_country_id
0   00000000             32
1  000050820             32
2  010310970             32
3   01033001             64
4  010330001             32

In [79]:
data_shipments['CEP'] =  data_shipments['CEP'].replace(to_replace=r'\D+', value='0', regex=True)

In [84]:
data_shipments.head(10)

         CEP  to_country_id
0   00000000             32
1  000050820             32
2  010310970             32
3   01033001             64
4  010330001             32
5  010340001             64
6  010400000            128
7   01041000             32
8  010460010             96
9   01046925             32

In [86]:
#Filtrando apenas pelo Country_id 32 (Brasil)
data_shipments = data_shipments.loc[data_shipments['to_country_id'] == 32]

## Normalizando DF Standart | Express

In [92]:
data_express = data_express.rename(columns = {'CEP INI' : 'CEP_INI'})
data_express = data_express.rename(columns = {'CEP FIN' : 'CEP_FIN'})

In [93]:
data_standard = data_standard.rename(columns = {'CEP INI' : 'CEP_INI'})
data_standard = data_standard.rename(columns = {'CEP FIN' : 'CEP_FIN'})

In [96]:
data_express.head(1)

    CEP_INI   CEP_FIN NOME COBERTURA  UF FRANQUIA  EXPRESSO
0  16800000  16849999   MIRANDOPOLIS  SP      AAN  ATENDIDO

In [95]:
data_standard.head(1)

    CEP_INI   CEP_FIN NOME COBERTURA  UF FRANQUIA  STANDARD
0  16800000  16849999   MIRANDOPOLIS  SP      AAN  ATENDIDO

# Construção da Range

In [160]:
data_express['CEP_RANGE'] = data_express.apply(lambda row: list(range(row['CEP_INI'], row['CEP_FIN']+1)), axis=1)

In [164]:
data_express.head(5)

,CEP_INI,CEP_FIN,NOME COBERTURA,UF,FRANQUIA,EXPRESSO,CEP_RANGE
0,16800000,16849999,MIRANDOPOLIS,SP,AAN,ATENDIDO,"[16800000, 16800001, 16800002, 16800003, 16800..."
1,16900001,16905265,ANDRADINA,SP,AAN,ATENDIDO,"[16900001, 16900002, 16900003, 16900004, 16900..."
2,16920000,16939999,CASTILHO,SP,AAN,ATENDIDO,"[16920000, 16920001, 16920002, 16920003, 16920..."
3,16950000,16979999,MURUTINGA DO SUL,SP,AAN,ATENDIDO,"[16950000, 16950001, 16950002, 16950003, 16950..."
4,16980000,16999999,GUARACAI,SP,AAN,ATENDIDO,"[16980000, 16980001, 16980002, 16980003, 16980..."

In [200]:
data_shipments.dtypes

CEP              int64
to_country_id    int64
dtype: object

In [185]:
match_values = data_shipments['CEP'].isin(data_express['CEP_RANGE'])

In [201]:
porcentagem = (match_values.sum() / len(data_shipments)) * 100

0.0